# "따라하며 배우는 파이썬과 데이터 과학" 정오표
## *책 내용에 있는 오류를 정리한 페이지 입니다. 불편을 끼쳐드려 대단히 죄송합니다. 다음 인쇄 때 수정하여 반영하겠습니다.*
## *책 증보판 발행시 소중한 기여자 분들의 id를 표기하여 감사의 마음을 표시하고자 합니다*
---

# 오류
## 잘못된 코드 오류, 실행 결과 오류, 잘못된 설명, 잘못된 참조 번호(그림, 코드 등) 

## 페이지 : 72쪽
### 오류내용 : 표의 지수 결과값에서 72가 아닌 7의 2승입니다.
<pre>
72 = 49
</pre>
* 수정 후
<pre>
7^2 = 49
</pre>

## 페이지 : 209쪽
### 오류내용 : 대칭차집합 메소드의 이름은 symmetric_difference() 입니다.
<pre>
대칭차집합은 ^ 연산자나 symmetry_difference() 메소드를 사용한다.
</pre>
* 수정 후
<pre>
대칭차집합은 ^ 연산자나 symmetric_difference() 메소드를 사용한다.
</pre>

<pre>
>>> A.symmetry_difference(B)
</pre>
* 수정 후
<pre>
>>> A.symmetric_difference(B)
</pre>

# 오탈자
## 단순 오자와 탈자를 알려드립니다.

## 페이지 : 290쪽
### 오류내용 : 코드 내부의 레이블를 -> 레이블을의 오자
<pre>
# y축에 레이블를 붙인다.
</pre>
* 수정 후
<pre>
# y축에 레이블을 붙인다.
</pre>
