#
# 따라하며 배우는 파이썬과 데이터과학(생능출판사 2020)
# 12.20 concat() 함수로 데이터프레임을 합쳐보자, 329쪽
#
import pandas as pd 

df_1 = pd.DataFrame( {'A' : ['a10', 'a11', 'a12'], 
                      'B' : ['b10', 'b11', 'b12'],
                      'C' : ['c10', 'c11', 'c12']} , index = ['가', '나',  '다'] )

df_2 = pd.DataFrame( {'B' : ['b23', 'b24', 'b25'],
                      'C' : ['c23', 'c24', 'c25'],
                      'D' : ['d23', 'd24', 'd25']} , index = ['다', '라',  '마'] )

df_3 = pd.concat( [df_1, df_2])  # df_1, df_2 두 데이터프레임을 합쳐서 df_3을 생성
print(df_3)